{
  "descricao_geral": "Grafo epidemiológico que integra casos de arboviroses (dengue, zika, chikungunya), notificações individuais do SINAN, atividades de controle vetorial (SISAWEB), informações meteorológicas diárias (NASA) e geometrias de municípios brasileiros. Todos os dados são ancorados em nós de Municipio e de Dia, permitindo análises espaciais e temporais combinadas.",
  "no": {
    "nome": "Dia",
    "label": "Dia",
    "descricao": "Representa um dia do calendário (granularidade diária), usado como eixo temporal comum.",
    "chave_unica": "date",
    "propriedades": {
      "date": {
        "tipo": "date",
        "descricao": "Data no formato YYYY-MM-DD.",
        "exemplo": "2020-01-10"
      }
    },
    "constraints": [
      "FOR (d:Dia) REQUIRE d.date IS UNIQUE"
    ]
  },
  "relacoes": [
    {
      "tipo": "TEM_DADO_NO_DIA",
      "de": "Municipio",
      "para": "Dia",
      "direcao": "Municipio -> Dia",
      "descricao": "Liga um município a um dia em que existe qualquer tipo de dado registrado (meteorologia, casos, atividades, notificações).",
      "cardinalidade": "Um Município pode ter muitos Dias, e um Dia pode estar ligado a muitos Municípios."
    },
    {
      "tipo": "TEM_METEOROLOGIA",
      "de": "Dia",
      "para": "Meteo",
      "direcao": "Dia -> Meteo",
      "descricao": "Liga o dia às variáveis meteorológicas daquele dia em cada município.",
      "cardinalidade": "Um Dia pode ter registros Meteo para vários Municípios; cada Meteo está ligado a exatamente um Dia."
    },
    {
      "tipo": "NO_DIA",
      "de": "AtividadeExec",
      "para": "Dia",
      "direcao": "AtividadeExec -> Dia",
      "descricao": "Associa a execução de atividade a um dia específico.",
      "cardinalidade": "Uma AtividadeExec ocorre em exatamente um Dia; um Dia pode ter muitas AtividadeExec."
    },
    {
      "tipo": "TEM_ATIVIDADE_RESUMO",
      "de": "Dia",
      "para": "AtividadeResumo",
      "direcao": "Dia -> AtividadeResumo",
      "descricao": "Liga o dia ao resumo diário de atividades por município e tipo.",
      "cardinalidade": "Um Dia pode ter muitos resumos para diferentes municípios e tipos."
    },
    {
      "tipo": "TEM_CASOS",
      "de": "Dia",
      "para": "Casos",
      "direcao": "Dia -> Casos",
      "descricao": "Associa o dia ao resumo de casos em cada município e agravo.",
      "cardinalidade": "Um Dia pode ter muitos Casos, para vários municípios e agravos."
    },
    {
      "tipo": "TEM_NOTIFICACAO",
      "de": "Dia",
      "para": "Notificacao",
      "direcao": "Dia -> Notificacao",
      "descricao": "Liga o dia às notificações cuja data está associada àquele dia no documento original (campo dt_notific).",
      "cardinalidade": "Um Dia pode ter muitas Notificacao em diferentes municípios."
    }
  ]
}